Revit 2027 API
Document.GetElement Method
Overload List
Name | Description
GetElement(ElementId) |  Gets the Element referenced by the input ElementId.
GetElement(Reference) |  Gets the Element referenced by the input reference.
GetElement(String) |  Gets the Element referenced by a unique id string.
Top
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace